# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

# strange_data_list = ['aaa', 0.1, True, 7, 3.14]
# i = 0
# while i < len(strange_data_list):
#     print(type(strange_data_list[i]))
#    i+=1

# 2. Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д. При нечетном количестве элементов последний сохранить на своем месте. Для заполнения списка элементов необходимо использовать функцию input().

print("enter data - using space bars  separates elements")
string_to_parse_on = input()
print(string_to_parse_on)
testt_arr = string_to_parse_on.split()
i=0
value_to_keep_data =None
if len(testt_arr) % 2 != 0:
    print("not even")
    while i < len(testt_arr) -1:
        value_to_keep_data = testt_arr[i]
        testt_arr[i] = testt_arr[i+1]
        testt_arr[i+1] = value_to_keep_data
        i += 2
        print(testt_arr)
else:
    while i < len(testt_arr):
        value_to_keep_data = testt_arr[i]
        testt_arr[i] = testt_arr[i+1]
        testt_arr[i+1] = value_to_keep_data
        i += 2
        print(testt_arr)

# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.
## 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
#
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
# 6. *Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена, количество, единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.